Repository: zabbix-jp/translation
Catalog: releasenote/releasenote-omegat.tmx
Source language: en_us
Languages: ja

source: [ZBX-1221] fixed node adding mechanizm
ja: [ZBX-1221] ノード追加のメカニズムを修正

source: [DEV-400] added necessary link between hosts and groups
ja: [DEV-400] ホストとグループ間の必要なリンクを追加

source: [ZBX-2960] split agentd userparameters out using includable files, add more MySQL examples
ja: [ZBX-2960] エージェントのユーザパラメータ設定を分離しincludeで読み込むように変更。MySQLのサンプルを追加

source: improved speed of copying triggers to host
ja: ホストにトリガーをコピーする速度を改善

source: [ZBX-70] fixed even more compilation warnings
ja: [ZBX-70] コンパイル時のワーニングを修正

source: [ZBX-2593] fixed possibility to copy item between templates that are linked to same host
ja: [ZBX-2593] 同じホストにリンクされたテンプレート間でアイテムがコピーできる可能性がある問題を修正

source: [ZBX-1337] renamed maintenance types for clarity
ja: [ZBX-1337] メンテナンスタイプを分かりやすい名称に変更

source: [DEV-75] Empty command result window
ja: [DEV-75] 空のコマンド結果ウィンドウ

source: Auto-registration with passive checks
ja: パッシブチェックによる自動登録

source: [ZBX-1184] fixed support of more than 10 CPU's for system.cpu.util under Linux
ja: [ZBX-1184] 10個以上のCPUを使用しているLinux上のsystem.cpu.utilの問題を修正

source: Unlimited number of map link styles
ja: 制限のないマップリンク形式

source: [ZBX-954] spacing cleanup
ja: [ZBX-954] 空白の除去

source: [ZBX-750] added multiple choice for trigger dependencies
ja: [ZBX-750] トリガーの依存関係の複数選択機能を追加

source: [ZBX-1968] fixed error in log item history in IE8
ja: [ZBX-1968] IE8使用時のログアイテムのヒストリで発生するエラーを修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.9.8 (Third Beta Release of Zabbix 2.0).
ja: Zabbix SIAはZabbix 1.9.7 (Zabbix 2.0の3番目のベータリリース)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2279] fixed error when changing graph name case
ja: [ZBX-2279] グラフ名の文字を変更する際のエラーを修正

source: [ZBX-3085] fixed possible stop to send data from proxy after shutdown of MySQL server; thanks to Takanori Suzuki
ja: [ZBX-3085] MySQLサーバのシャットダウン後にProxyのデータ送信が停止してしまう問題を修正; Takanori Suzukiに感謝

source: [ZBXNEXT-238] made zabbix_sender gather as much data as possible before sending
ja: [ZBXNEXT-238] zabbix_senderで送信する前にできるだけ多くのデータを蓄積できるように修正

source: [ZBX-954] fix minor typos and removed // comments
ja: [ZBX-954] 誤字の修正と//コメントの削除

source: Disabling of a group of users
ja: ユーザグループの無効化機能

source: New Supported Checks
ja: 新しく利用できるチェック機能

source: There are significant improvements in the database schema for better consistency and security of configuration and historical data.
ja: データベースのスキーマを大幅に改善し、一貫性、設定とヒストリデータのセキュリティを向上しました。

source: [ZBX-2013] fixed error in trigger test screen
ja: [ZBX-2013] トリガーテスト画面のエラーの問題を修正

source: [ZBX-2741] updated French translation; thanks to Alixen
ja: [ZBX-2741] フランス語翻訳を更新; Alixenに感謝

source: [ZBX-1752] fixed error showing maps when REGISTER_GLOBALS in PHP is on
ja: [ZBX-1752] PHPでREGISTER_GLOBALSが有効になっている場合のマップ表示のエラーを修正

source: [ZBX-3557] fixed possible incorrect usage of internal array pointers in frontend
ja: [ZBX-3557] Webインターフェース内の内部の配列のポインタの誤った使い方を修正

source: Increased number of log entries sent per second
ja: 1秒あたりに送信できるログエントリ数の増加

source: [ZBX-1010] fixed processing of a vfs.fs.size metric on Solaris with filesystems larger than 2TB
ja: [ZBX-1010] 2TB以上のファイルシステムを持つSolarisのvfs.fs.sizeの処理を修正

source: [ZBX-2616] bundled DejaVu font upgraded from 2.31 to 2.32
ja: [ZBX-2616] DejaVuフォントを2.31から2.32にアップグレード

source: [ZBX-3115] fixed returned data type for system.users.num metric
ja: [ZBX-3115] system.users.numが返す値のデータ型を修正

source: [ZBX-67] added synchronization of binary data between nodes
ja: [ZBX-67] ノード間のバイナリデータの同期機能を追加

source: [ZBX-2139] fixed collecting of active checks after configured with user macro
ja: [ZBX-2139] ユーザマクロを用いて設定すると、アクティブチェックの収集ができない問題を修正

source: This document contains the release notes for ZABBIX 1.1.6.
ja: このドキュメントはZABBIX 1.1.6のリリースノートです。

source: [ZBX-2731] fixed permissions problem with hostgroup names containing '[]'
ja: [ZBX-2731] ホストグループ名に'[]'が入っている場合の権限の問題を修正

source: [ZBX-3027] avg, delta, max, min, sum functions in popup_trexpr.php have a time shift input, so that this parameter now can be specified through GUI
ja: [ZBX-3027] popup_trexpr.phpでavg, delta, max, min, sum関数を利用時にタイムシフトを入力できるようにし、入力をGUIから行えるように修正

source: [ZBX-2376] added ldap, ldap_perf, ntp, and ntp_perf simple checks
ja: [ZBX-2376] シンプルチェックldap、ldap_perf、ntp、ntp_perfを追加

source: [ZBXNEXT-510] sending of SMS messages through Ez Texting is now integrated into Zabbix
ja: [ZBXNEXT-510] Ez Textingを利用したSMSメッセージの送信機能をZabbixに実装

source: removed net-snmp debug messages from server logs
ja: サーバのログからnet-snmpデバッグメッセージを削除

source: [ZBX-3061] fixed screen import problem with "Status of triggers" screen type
ja: [ZBX-3061] スクリーンで「トリガーのステータス」タイプの画面をインポートした際の問題を修正

source: [ZBX-1788] fixed proxy configuration form showing hosts from all nodes
ja: [ZBX-1788] プロキシ設定フォームで全てのノードのホストを表示する際の問題を修正

source: Automatic collection of host profile data
ja: ホストプロファイルデータの自動収集

source: [ZBX-339] fixes problem in frontend with clearing history for text items
ja: [ZBX-339] フロントエンド中のテキストデータのアイテムの履歴の削除処理の問題を修正

source: [ZBXNEXT-319] multirow inserts are now used for PostgreSQL 8.2 and higher
ja: [ZBXNEXT-319] PostgreSQL 8.2以降で複数行のinsertを利用するように改善

source: Maps support ability to mark map elements that have their state changed recently.
ja: マップ上に直近に変化したトリガーを表示できるようになりました。

source: [ZBX-4326] API now returns error when trying to create incorrect host profile field
ja: [ZBX-4326] 誤ったホストプロファイルのフィールドの作成時にエラーを返すようにAPIを修正

source: Improved time picker
ja: タイムピッカーの改善

source: [ZBX-1859] fixed map element image
ja: [ZBX-1859] マップの要素のイメージを変更できない問題を修正

source: [ZBX-418] fixed possible server crash while processing macros
ja: [ZBX-418] マクロ処理中にサーバがクラッシュする問題を修正

source: Other Improvements
ja: その他の改善

source: Added support of zabbix[proxy,<proxyname>,lastaccess]
ja: zabbix[proxy,,lastaccess]を追加

source: trigger description in "Last 20 issues" is link to the URL defined in trigger parameters + minor GUI typos fix
ja: 「最新の20件の障害」のトリガー詳細の項目をトリガーパラメータで定義したURLへリンクするように修正し、マイナーな表記間違いを修正

source: Much more efficient polling
ja: より効率的なポーリング

source: This document contains the release notes for ZABBIX 1.1.5.
ja: このドキュメントはZABBIX 1.1.5のリリースノートです。

source: [ZBX-1384] fixed memory leak in processing ldap checks
ja: [ZBX-1384] ldap監視の処理中のメモリリークが発生する問題を修正

source: [ZBX-998] modified PostgreSQL schema for support of uint64 history values
ja: [ZBX-998] uint64ヒストリ値をサポートするようにPostgreSQLのスキーマを修正

source: [ZBX-4027] fixed floating-point comparison and unified epsilon in trigger functions and expressions
ja: [ZBX-4027] トリガーの関数や条件式の浮動小数の比較処理を修正し、計算に利用する小数点以下の桁数を統一

source: added disabled images in the elements of maps
ja: マップの要素に画像の無効化を追加

source: A nice overview of the new features is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.3.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.3から参照することができます。

source: This document contains the release notes for ZABBIX 1.4.2.
ja: このドキュメントはZABBIX 1.4.2のリリースノートを含みます。

source: Thanks to Hannu Ylitalo
ja: Hannu Ylitaloに感謝

source: [ZBX-2864] fixed print button creating multiple sid url parameters
ja: [ZBX-2864] プリントボタンが複数sidのurlパラメータを生成するように修正

source: Zabbix SIA is proud to announce the availability of Zabbix 1.8.8rc1 (First Release Candidate).
ja: Zabbix SIAはZABBIX 1.8.8rc1 (1番目のRelease Candidate)のリリースをアナウンスすることを光栄に思います。

source: [ZBX-2059] fixed special char treatment in XML export
ja: [ZBX-2059] XMLエクスポート時の特殊文字の扱いを修正

source: added full clone to hosts
ja: ホストの完全クローン機能を追加

source: Use PostgreSQL 8.x for better performance and more flexible autovacuum.
ja: より良いパフォーマンスと、よりフレキシブルなオートバキュームのためにPostgre8.xを利用してください。

source: New parameters, NodeNoEvents and NodeNoHistory, controls if a node should send events and historical data to a master node.
ja: ノードからマスターノードへのイベントとヒストリのデータ送信をコントロールするための、新しいパラメータNodeNoEventsとNodeNoHistoryを追加しました。

source: [ZBX-4026] fixed disabling SNMP host when unreachable
ja: [ZBX-4026] unreachable時のSNMPホストの無効化を修正

source: The release may or may not work on your system.
ja: このリリースは動作保証しません。

source: [ZBX-1546] fixed processing link triggers on map
ja: [ZBX-1546] マップにおけるトリガーのリンク処理を修正

source: [ZBX-2859] fixed possibility to successfully delete zero regular expressions
ja: [ZBX-2859] 正規表現が登録されていない時に削除が実行できてしまう問題を修正

source: [ZBXNEXT-357] added support of user macros in parameters field of database item; thanks to Kirill Fateev
ja: [ZBXNEXT-357] データベースアイテムのパラメータフィールドにユーザマクロのサポートを追加; Kirill Fateevに感謝

source: This document contains the release notes for ZABBIX 1.1.4.
ja: このドキュメントはZABBIX 1.1.4のリリースノートです。

source: other bug fixes and minor improvements
ja: その他のバグフィックスとマイナーな改善

source: [ZBX-1320] fixed graph header alignment
ja: [ZBX-1320] グラフのヘッダの位置を修正

source: [ZBX-2914] unified pidfile path in example Debian initscripts with example config files
ja: [ZBX-2914] Debian用のサンプルinitscriptとサンプル設定ファイル中のpidファイルのパスの設定を統合

source: [ZBX-453] fixed --disable-static enabling static compilation
ja: [ZBX-453] スタティックコンパイル時に--disable-staticオプションが有効になっていた問題を修正

source: [ZBX-2492] updated Japanese translation; thanks to Kodai Terashima
ja: [ZBX-2492] 日本語翻訳を更新; Kodai Terashimaに感謝

source: New release of the Manual will be available with the next beta release.
ja: 新しいマニュアルは次のベータリリースで公開する予定です。

source: This release is not for production use.
ja: このリリースは正式バージョンではありません。

source: This document contains the release notes for ZABBIX 1.4.1.
ja: このドキュメントはZABBIX 1.4.1のリリースノートを含みます。

source: A list of host groups can be passed as a parameter to aggregate checks.
ja: アグリゲートチェックのパラメータにホストグループのリストを使用することができます。

source: [ZBX-1581] fixed wrong group saved as discovery group in Administration->General
ja: [ZBX-1581] 管理->一般設定のディスカバリグループに誤ったグループが設定されたいた問題を修正

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.1.
ja: ZABBIX SIAはZABBIX 1.6.1のリリースをアナウンスすることを光栄に思います。

source: [ZBX-4288] fixed user macros not being deleted when deleting a host
ja: [ZBX-4288] ホスト削除時にユーザマクロが削除されない問題を修正

source: [ZBX-1027] fixed that item key must be used in each subexpression of trigger expression
ja: [ZBX-1027] トリガー条件式の各サブ条件式にアイテムのキーを利用できるように修正

source: [DEV-250] added support of vfs.dev.read/write under Linux 2.4/2.6
ja: [DEV-250] Linux 2.4/2.6にアイテムvfs.dev.read/writeを追加

source: [ZBX-2576] small text changes in administration/audit
ja: [ZBX-2576] 管理/監査の細微な文字の変更

source: [ZBX-1508] fixed action map creation
ja: [ZBX-1508] マップ作成の動作を修正

source: [ZBX-1606] fixed showing icon errors with qoutes in error text
ja: [ZBX-1606] エラーテキストに引用符がある場合のアイコンのエラー表示を修正

source: [ZBX-4157] fixed possible truncating of queries while preparing a configuration data for sending to a proxy
ja: [ZBX-4157] プロキシに送付するデータの作成中にクエリが途中で切れる可能性がある問題を修正

source: It is highly recommended to upgrade from 1.6, 1.6.1, 1.6.2 and 1.6.3.
ja: このリリースはZABBIX 1.6、1.6.1、1.6.2、1.6.3からアップグレードすることを強く推奨します。

source: [ZBX-1600] added support of value mapping for {ITEM.VALUE} macro in notifications
ja: [ZBX-1600] 通知用マクロ{ITEM.VALUE}に値のマッピングのサポートを追加

source: [ZBX-974] recompress some images with pngcrush
ja: [ZBX-974] pngcrushを利用していくつかの画像を再圧縮

source: This document contains the release notes for ZABBIX 1.1.3.
ja: このドキュメントはZABBIX 1.1.3のリリースノートです。

source: Several screens can be grouped in a slideshow.
ja: 複数のスクリーンをスライドショーの中にグループ分けすることができます。

source: [DEV-405] Proxies, Nodes moved under "Administration->DM"
ja: [DEV-405] プロキシ、ノードを「管理->分散監視」配下に移動

source: [ZBX-842] fixed duplicate triggers in "Last 20 issues" in dashboard
ja: [ZBX-842] ダッシュボードの「最新20件の障害」のトリガーの重複を修正

source: [ZBX-1708] fixed errors in log items history screen
ja: [ZBX-1708] ログアイテムのヒストリ画面のエラーを修正

source: [ZBX-1303] fixed usergroup linkage to users
ja: [ZBX-1303] ユーザグループとユーザのリンクの問題を修正

source: [DEV-461] improved map creation/editing by adding align option
ja: [DEV-461] 整列オプションの追加によりマップ作成/編集を改善

source: [ZBX-2337] fixed error when selecting a web item in trigger configuration
ja: [ZBX-2337] トリガー設定画面でウェブアイテムを選択した場合のエラーを修正

source: [DEV-454] implemented screen export
ja: [DEV-454] スクリーンのエクスポートを実装

source: [ZBX-939] fixed IPC semaphore related issue when starting Zabbix daemons
ja: [ZBX-939] ZABBIXデーモンを起動した際のIPCセマフォ関連の問題を修正

source: [ZBX-3826] fixed recovering unsupported icmpping* items when a key has been entered incorrectly
ja: [ZBX-3826] キーが誤って入力され取得不可状態になったicmpping*アイテムが正しく修正されたときに監視を再開するよう修正

source: [ZBX-3047] fixed Zapcat compatibility for trigger expressions
ja: [ZBX-3047] トリガー条件式のZapcatとの互換性を修正

source: Support of quotes in parameters of items.
ja: アイテムのパラメータに引用府を利用することができます。

source: [ZBX-1906] fixed possibility to add identical checks for discovery
ja: [ZBX-1906] ディスカバリーのチェックで同一の対象が追加される可能性を修正

source: [ZBX-2934] added new conf.
ja: [ZBX-2934] 新しい設定ファイルを追加。

source: [ZBX-2217] fixed JS error in status of triggers page in IE
ja: [ZBX-2217] IEでトリガーのステータス画面にJSのエラーが表示される問題を修正

source: ZABBIX Server has been compiled and tested on the following platforms:
ja: ZABBIXサーバは以下のプラットフォームでコンパイルおよびテストされています。

source: Now quoted numeric SNMP data can be automatically processed.
ja: クォートされたSNMPデータを自動的に処理することができます。

source: [ZBX-2290] fixed image update with oracle db
ja: [ZBX-2290] oracle db利用時のイメージの更新を修正

source: [ZBX-3068] fixed server memory leak while processing passive proxies
ja: [ZBX-3068] パッシブプロキシの処理中のサーバのメモリリークを修正

source: added fullscreen icon to monitoring screens
ja: 監視中のスクリーンに全画面のアイコンを追加

source: [ZBX-1958] fixed problem with a lot of digits in float values
ja: [ZBX-1958] 浮動小数値に大量の桁数がある場合に発生する問題を修正

source: This document contains the release notes for ZABBIX 1.1.2.
ja: このドキュメントはZABBIX 1.1.2のリリースノートです。

source: Distributed monitoring: added update of Last check and Last value fields
ja: 分散モニタリング: 最終チェックと最終値フィールドのアップデートを追加

source: Added time filter to Availability Report
ja: 稼働レポートの時間によるフィルタ機能を追加

source: Escalation can be configured in a very flexible way and may include not only notifications but also execution of remote and IPMI commands.
ja: エスカレーションは非常に柔軟に設定することができ、通知だけでなくリモートコマンドやIPMIコマンドを実行することができます。

source: Zabbix sender supports reading of data from standard input
ja: Zabbix senderが標準入力からのデータ読み込みをサポート

source: [ZBX-1522] fixed server crash on an undefined user macro
ja: [ZBX-1522] 未定義のユーザマクロ使用時のサーバクラッシュを修正

source: [ZBX-2914] fixed incorrect references in Fedora initscripts
ja: [ZBX-2914] Fedora用のinitscript内の誤った参照を修正

source: This document contains the release notes for ZABBIX 1.4.4.
ja: このドキュメントはZABBIX 1.4.4のリリースノートを含みます。

source: fixed "Undefined index error" during frontend installation
ja: Webインターフェースのインストール中の「Undefined index error」を修正

source: [ZBX-564] added more descriptive message on conflict of templates
ja: [ZBX-564] テンプレートのコンフリクトが発生した際により詳細なメッセージを表示するように修正

source: [ZBX-633] removed linkage of OpenIPMI library to Agents in "configure" script
ja: [ZBX-633] "configure"スクリプトでエージェントに対するOpenIPMIライブラリのリンクを削除

source: [DEV-268] added support of system.cpu.num/util/load/intr/switches, system.uptime under AIX
ja: [DEV-268] AIX用エージェントにアイテムsystem.cpu.num/util/load/intr/switches、system.uptimeを追加

source: [DEV-238] added support of text items for function count()
ja: [DEV-238] count()関数にテキストアイテムの設定を追加

source: [ZBX-2011] fixed e-mail sending format to meet 'SMTP/MIME e-mail' standards since UTF-8 is used.
ja: [ZBX-2011] UTF-8への対応により「SMTP/MIME」標準に合わせてメールを送信するように修正。

source: [ZBX-2459] fixed setting trigger value to unknown on disabling
ja: [ZBX-2459] トリガーを無効にするとトリガーの値がunknownに変更されるように修正

source: This document contains the release notes for ZABBIX 1.4.3.
ja: このドキュメントはZABBIX 1.4.3のリリースノートを含みます。

source: Support of automatic selection of map icons
ja: マップのアイコンの自動選択

source: [ZBX-354] added support of new parameter sec|#num for str(),regexp() and iregexp()
ja: [ZBX-354] str()、regexp()、iregexp()のために新しいパラメータsec|#numを追加

source: [ZBX-3426] fixed application unlink and clear when it is linked from template
ja: [ZBX-3426] テンプレートからリンクされた場合のアプリケーションのリンク削除とクリア処理を修正

source: [ZBXNEXT-58] added zabbix[{history_log,history_text,history_uint,trends_uint}] internal checks
ja: [ZBXNEXT-58] 内部チェックにzabbix[{history_log,history_text,history_uint,trends_uint}]を追加

source: [ZBX-3195] fixed slow sync of trends data while server shutdown
ja: [ZBX-3195] サーバシャットダウン中にトレンドデータの同期が遅かった問題を修正

source: [ZBX-2860] fixed usergroup renaming
ja: [ZBX-2860] ユーザグループの名前変更を修正

source: [ZBX-131] fixed viewing password on install in plain text
ja: [ZBX-131] インストール時にプレーンテキスト中にパスワードが見えてしまう問題を修正

source: [ZBX-4021] fixing item visibility in event then last value is null
ja: [ZBX-4021] 最新の値が存在しない場合のアイテムの表示を修正

source: [ZBX-3145] fixed user macros resolving
ja: [ZBX-3145] ユーザマクロが展開できない問題を修正

source: [ZBX-4275] made server and proxy try to reconnect to the database upon startup
ja: [ZBX-4275] データベースが起動するまで再接続を繰り返すようにZabbixサーバとプロキシ修正

source: Agent-less monitoring based on Telnet and SSH
ja: TelnetとSSHを利用したエージェントレスの監視

source: [ZBX-2575] removed outdated and undocumented environment variables from alert scripts
ja: [ZBX-2575] アラートスクリプトからドキュメントに記載されていない古い環境変数を削除

source: Zabbix Server was improved to calculate certain text and log related trigger expressions much faster without use of database queries.
ja: Zabbix Serverの特定のテキストやログに関するトリガー条件式の計算処理を改善し、データベースへのクエリを行わずに高速に処理できるようになりました。

source: Support of IPMI
ja: IPMIのサポート

source: [ZBX-2923] fixed triggers that depend on problem trigger are shown as problem on map
ja: [ZBX-2923] 障害の状態のトリガーに依存しているトリガーがマップ上で障害として表示される問題を修正

source: [ZBX-3890] added logging of ORACLE warning messages while connecting to the database
ja: [ZBX-3890] データベース接続中のOracle警告メッセージログ出力を追加

source: Added screen for better management of translations
ja: 翻訳の管理画面を追加

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.4.
ja: ZABBIX SIAはZABBIX 1.6.4のリリースをアナウンスすることを光栄に思います。

source: [DEV-455] added configurable filter to "Status of triggers" screen element
ja: [DEV-455] 「トリガーのステータス」画面に設定可能なフィルタを追加

source: Optionally you may upgrade your agents.
ja: ZABBIXエージェントのアップグレードは必須ではありません。

source: A nice overview of the new features is at http://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.4.
ja: 新機能の概要はhttp://www.zabbix.com/documentation/1.8/manual/about/what_s_new_1.8.4から参照することができます。

source: [ZBX-868] fixed incorrect processing of not supported internal checks
ja: [ZBX-868] サポートされていない内部チェックの間違った処理を修正

source: [ZBX-2913] fixed agent becoming unresponsive due to web.page.* checks
ja: [ZBX-2913] web.page.*チェック時にエージェントが応答しなくなる問題を修正

source: fixed memory leak while processing proc.num metric under Win2008
ja: Win2008上のproc.numの処理中のメモリリークを修正

source: [DEV-421] added additional parameter `maxlines' to `log[]' and `eventlog[]' checks
ja: [DEV-421] 「log[]」と「eventlog[]」監視に「maxlines」パラメータを追加

source: [ZBX-4155] fixed .pid file locking not to allow multiple instances
ja: [ZBX-4155] .pidファイルによる複数インスタンスの起動禁止処理を修正

source: [ZBX-3874] always enable all trigger severity checkboxes after enabling GUI Messaging in user profile
ja: [ZBX-3874] ユーザプロファイル画面でGUIメッセージを有効にした後、すべてのトリガー重要度のチェックボックスが有効になるように修正

source: [ZBX-341] fixed compilation problem under Tru64/OSF
ja: [ZBX-341] Tru64/OSF上でのコンパイルの問題を修正

source: The proxies can be used to create distributed centralised monitoring of remote locations all reporting to a central server or one of ZABBIX nodes.
ja: プロキシを利用することにより遠隔地の集中監視を行うことが可能になり、中央のサーバまたはZABBIXノードの1つですべてのレポートを管理することができます。

source: [ZBX-1404] fixed undefined variable in screens
ja: [ZBX-1404] スクリーン上で定義されていない変数が存在する問題を修正

source: This document contains the release notes for ZABBIX 1.1.1.
ja: このドキュメントはZABBIX 1.1.1のリリースノートです。

source: [ZBX-2379] fixed trigger expression editing with trigger builder
ja: [ZBX-2379] トリガーの作成補助機能を利用したトリガー条件式の編集時の問題を修正

source: [ZBX-1633] fixed sysmaps in PostgreSQL upgrade patch
ja: [ZBX-1633] PostgreSQLのアップグレードパッチのsysmapsを修正

source: [ZBX-2899] fixed slideshow delays broken after upgrade from 1.8.2
ja: [ZBX-2899] Zabbix 1.8.2からのアップグレード後、スライドショーの間隔設定が壊れてしまう問題を修正

source: ZABBIX 1.6 Manual
ja: ZABBIX 1.6マニュアル

source: Note that ZABBIX database and ZABBIX server and agent processes are still not ready for correct processing of UTF-8 data.
ja: ZABBIXデータベースとZABBIXサーバ、エージェントはまだUTF-8のデータを正しく処理することができません。

source: New SNMP trap monitoring provides high performance way of collecting traps, pre-processors such as SNMPTT could be used as well.
ja: 新しいSNMPトラップ監視機能によって高性能なトラップ収集を行えるようになりました。SNMPTTなどのプリプロセッサも同様に使用できます。

source: [ZBX-2341] fixed cutting 20 bytes instead of 20 symbols in char/log/text item values
ja: [ZBX-2341] 文字列/ログ/テキストのアイテムの値を20バイトから20文字切り出すように修正

source: [ZBX-3749] escaped HTML entities in the web step "required" field
ja: [ZBX-3749] ウェブ監視のステップの「要求文字列」のHTML要素をエスケーブするように修正

source: You may upgrade from ZABBIX 1.1, 1.1.1, 1.1.2, 1.1.3, 1.1.4, 1.1.5 directly to 1.1.6.
ja: ZABBIX 1.1、1.1.1、1.1.2、1.1.3、1.1.4、1.1.5から1.1.6に直接アップグレードする場合、

source: [DEV-398] added hostgroup filter for HostGroup and TemplateLinkage twinboxes
ja: [DEV-398] ホストグループとテンプレートとのリンクの選択ボックスにホストグループのフィルタを追加

source: ZABBIX SIA is proud to announce the availability of Zabbix 1.7.4 (beta).
ja: ZABBIX SIAはZABBIX 1.7.4(beta)のリリースをアナウンスすることを光栄に思います。

source: Zabbix front-end will save grid-options for each map.
ja: Zabbix Webインターフェースは、それぞれのマップごとにグリッドオプションを保存することができます。

source: [ZBX-2298] added constant to defines to be able configure default Y axis position: left or right
ja: [ZBX-2298] デフォルトのY軸の位置(右または左)を設定できる定数を追加

source: ZABBIX SIA is proud to announce the availability of ZABBIX 1.6.5.
ja: ZABBIX SIAはZABBIX 1.6.5のリリースをアナウンスすることを光栄に思います。

source: Flexible Configuration of Default Dropdown Behaviour
ja: デフォルトのドロップダウンの動作の柔軟な設定

source: [ZBX-181] fixed Activate/Disable items from applications
ja: [ZBX-181] アプリケーション設定からアイテムを有効化/無効化した場合の問題を修正

source: [ZBX-893] fixed error creating trigger when in Host dropdown selected All
ja: [ZBX-893] ホストドロップダウンで全てを選択した場合のトリガー作成エラーを修正

source: The following functionality is introduced in 1.5.x releases and will be available in stable ZABBIX 1.6.
ja: 以下の機能は1.5.xのリリースで追加され、安定版であるZABBIX 1.6で利用することができるようになります。

source: More flexible host-template linkage saves time and make the configuration of hosts more flexible and straight forward.
ja: よりフレキシブルなホストテンプレートリンクは、設定の時間を削減し、ホストの設定をよりフレキシブルかつ容易にします。

source: Much Faster Dynamic SNMP Indexes
ja: ダイナミックSNMPインデックスの大幅な速度改善

source: [DEV-329] fixed server crash if PostgreSQL transaction fails
ja: [DEV-329] PostgreSQLのトランザクションが失敗した場合にサーバがクラッシュする問題を修正

source: fixed item multiple cleaning on mass update
ja: 一括更新によるアイテムの乗数設定の削除を修正

source: [ZBX-1468] fixed editing user media types on node with id > 99
ja: [ZBX-1468] IDが99よりも大きなノードのユーザのメディアタイプの変更を修正

source: [ZBX-3747] replaced strcpy() and vsnprintf() calls with safer ones and strerror() with zbx_strerror() which also prints the error code
ja: [ZBX-3747] strcpy()とvsnprintf()の呼び出しをより安全な関数呼び出しに置き換え、エラーコード出力のためstrerror()をzbx_strerror()に置き換え

source: Download it from http://www.zabbix.com/download.php.
ja: ダウンロードはこちらから行えます。 http://www.zabbix.com/download.php

source: Download, read and print ZABBIX manual!
ja: ZABBIXマニュアルをダウンロード、プリントアウトすることができます。

source: [DEV-465] added messaging system
ja: [DEV-465] メッセージングシステムを追加

source: Global provide suggestions, based on the entered string.
ja: 入力した文字列に基づいて検索候補を表示します。

source: Communication protocol has been improved to support sending of multiple values by one TCP connection.
ja: 通信プロトコルは1つのTCPコネクションで複数のデータを送信するように改善されました。

source: [ZBXNEXT-900] added support of {TRIGGER.ID} macro in a trigger url
ja: [ZBXNEXT-900] トリガーURLに{TRIGGER.ID}マクロのサポートを追加

source: [ZBX-931] fixed timeout handling for agent's user parameters
ja: [ZBX-931] エージェントのユーザーパラメータのタイムアウト処理を修正

source: This document contains release notes for ZABBIX 1.5.
ja: このドキュメントhZABBIX 1.5のリリースノートを含みます。

source: Dashboard
ja: ダッシュボード

source: [ZBX-1444] added map link macro {host:key.func(param)}
ja: [ZBX-1444] マップリンクのマクロ{host:key.func(param)}を追加

source: WEB monitoring
ja: Webモニタリング

source: [ZBX-1838] fixed value mapping in overview screen
ja: [ZBX-1838] 概要画面の値のマッピングを修正

source: See details for a preview of other important changes.
ja: その他の重要な変更の詳細はこちらを参照してください。
